[
	{
		"title": "Fish.Intro",
		"tags": "",
		"body": "//Switch to Bargain barrel background, The music sounds reminiscent of classic mafia music.\n<<changeBackgrounf Bargain>>\n<<playAudio BGMBargain>>\n<<enterStage Alici>>\n<i>As Pengi enters the store, their eyes are bombarded by an assortment of odd items splayed everywhere for display and sale.</i>\n\n<i>The arrangements of these items seem to lack any rhyme or reason.</i>\n\n<i>A vending machine simultaneously selling candy bars and fish soup was propped up against the wall while barrels of coins, buttons and rice were against another.</i>  </i> \n\n<i>The place seemed to be in utter chaos.</i>\n\nP: <i>This is the last place on the list I think…?</i>\n\n<i>Pengi looks around and doubles checks that they are in the right place. </i>\n\nP: <i>Is-Is-Is this even a real store?</i>\n\nP: Hello? Is anyone here?\n\n<i>From the back of the store comes the rolling clang of metals striking the floor, like someone had accidentally knocked over an antique collection of frying pans</i>. \n<i>Because of course any self respecting store would have that available.</i> \n<i>The door behind the counter opens as an anchovy wearing a high collar shirt and apron appears from behind it.</i>\n\n<i>The anchovy fish-eyes Pengi through his water filled tank before clearing his throat.</i>\n\nA: Hello my friend, name’s Alici. Nice of you to roll on into <b>The Bargain Barrel</b>.\n\n<i>His voice is shrouded by a thick italian accent and the water inside his tank.</i>\n<i>He approaches with his back straightened and casually wraps his arm around Pengi, pressing them forwards to walk around the store.</i>\n\nA: I see you have quite the… surprised look on your face. \nA: We get that all the time here in <b>The Bargain Barrel</b>, but trust me when I say that we are business at its finest. \nA: You see,\nA: <b>The Bargain Barrel</b> is the <size=125%>FUTURE</size> of retail.\n<i>He lets out a watery gurgle of a giggle.</i>\n\n-> Say nothing\n    <i>Alici nudges Pengi over to a display showcasing the latest smartphone released on the market, The Orange X, placed neatly next to a stack of actual oranges.</i>\n\n    A: We got a real deal here for you! Ever wanted to use an Orange smartphone while <i><b>eating</b></i> an orange? \n    A: Well try our one for twenty bundle where we slap a bunch of oranges with your brand new Orange!\n\n-> Um...a little space please?\n    <i>Pengi clears their throat.</i>\n    P: E-e-excuse me sir, I’d appreciate it if you could give me a little bit of space. N-n-no offence, I appreciate your e-e-energy. I just like having some space.\n\n    <i>Alici pulls back his arm.</i>\n    <i>In fact, he pulls back his entire body away, and Pengi notices the calm persona break as a hint of panic overtakes the fish for a split second.</i>\n\n    A: Ah, my apologies!\n\n    <i>Alici clears his throat again and regains his composure.</i>\n\n    A: Just a little too friendly I guess. Moving on.\n\n    P: <i><size=80%>Interesting...</size></i>\n\n    <i>Alici walks over to a display showcasing the latest smartphone released on the market, The Orange X, placed neatly next to a stack of actual fresh oranges.</i>\n    A: We got a real deal here for you. Ever wanted to use an Orange smartphone while <i><b>eating</b></i> an orange? \n//variables for options available\n<<set $FishShoe to 1>>\n<<set $FishOrange to 1>>\n<<set $FishHistory to 1>>\n[[Fish.Choices]]",
		"position": {
			"x": -2150,
			"y": -248
		},
		"colorID": 0
	},
	{
		"title": "Fish.Choices",
		"tags": "",
		"body": "//ew nested if, will fix when have time urg \n<<if $FishShoe is 0>>\n    <<if $FishOrange is 0>>\n        <<if $FishHistory is 0>>\n            [[Fish.DoneChoices]]\n        <<endif>>\n    <<endif>>\n<<endif>>\n\nP: <i>Hmmm...</i>\n[[Well you see, I’m looking for a...boot?|Fish.Shoe]]\n[[Inspect the Orange smartphone.|Fish.Orange]]\n[[Ask about the store’s history.|Fish.History]]",
		"position": {
			"x": -1583,
			"y": -242
		},
		"colorID": 0
	},
	{
		"title": "Fish.Shoe",
		"tags": "",
		"body": "<<set $FishShoe to 0>>\nP: Well you see, I’m looking for a...boot? \n<i>He looked thoughtfully around the store before shaking his fish-bowl head.</i>\nA: Hmmm...funnily enough, sold our last boot to a fellow just five minutes ago.\nA: Sorry kid.\nA: But don’t even worry about that! We have so many things to choose from!\nA: We are sure to not disappoint. \n[[Fish.Choices]]",
		"position": {
			"x": -1842,
			"y": -518
		},
		"colorID": 0
	},
	{
		"title": "Fish.Orange",
		"tags": "",
		"body": "<<set $FishOrange to 0>>\n\n<i>Pengi squints their eyes at the phone and notices the screen has a watermark on it.</i>\nP: A-are you sure that’s a new phone? It looks like it's a fake.\n\n<i>Eyes widening, Alici snatches the phone from its display and shoves it in his pocket.</i>\n<i>His sudden movement spills some of his tank water onto the hardwood floor.</i>\n\nA: That must have been our testing version!\n\n<i>A nervous stream of bubbles escape his mouth as he speaks..</i>\n\nA: Yes, yes, our testing version. Apologies, I’ll have to talk to our tech experts to get a real one working. \n\nA: You know those tech idiots right? Too busy watching game streams to actually get the job done.\n\nP: Your store is also a tech...shop?\n\nA: Like I said… <b>The Bargain Barrel</b> is the future… hah ha…\nA: Now about these oranges-\n\n<i>His fisheye hastily looks back towards the pile of oranges.</i>\n\nP: <i>…</i>\nP: <i>This place is a little suspicious. </i>\nP: <i>I might be able to use that to get this fishy fellow to sign the document if I press further...</i>\n[[Fish.Choices]]",
		"position": {
			"x": -1586,
			"y": -516
		},
		"colorID": 0
	},
	{
		"title": "Fish.History",
		"tags": "",
		"body": "<<set $FishHistory to 0>>\n\nP: So, this store has been here for a while?\n<i>Alici places a fin on his chest and lets out a laugh.</i>\nA: Ha! You have no idea kid!\nA: I’d say that we are the lifeblood of this little Menagerie. Without us, history wouldn’ have been all that deep. \nA: I guess I wouldn’t have been anything without this life kid.\n<i>He frowns a little as he says this, a look of confusion crossing his eyes before letting out another chuckle.</i>\nA: Well..never got the chance to find out…\nA: <size=150%>BUT NEVER MIND THAT!</size>\nA: Anything I can help you find? \nA: A glass of expi- I mean fermented apples? Or perhaps a rust- I MEAN some antique copper plates? \n[[Fish.Choices]]",
		"position": {
			"x": -1307,
			"y": -513
		},
		"colorID": 0
	},
	{
		"title": "Fish.DoneChoices",
		"tags": "",
		"body": "P: <i>I’m not really sure what to do.</i>\nP: <i>This place seems very fishy and if I press on he might <b>sign the document</b>.</i>\nP: <i>But...</i>\nP: <i>I also feel like there is more to this <b>fish’s story</b> than meets the eye...</i>\nP: <i>...</i>\nP: <i>I guess I’ll…</i> \n\n-> Pressure Alici on my suspicions…\n    [[Fish.Investigate]]\n\n-> Dig deeper on Alici’s history....\n    P: Can you tell me more about this place? And how it got to selling Oranges with oranges?\n    <i>He freezes in place before looking down Pengi.</i>\n    A: Wow wow! What’s with all the questions here…\n    <i>He squints.</i>\n    A: You a cop or something?\n\n    -> Tell him you’re a cop (Lie).\n        P: <i>Maybe I can find out more about him if I just tell this <size= 80%>smalllll-itty-bitty lie</size>.</i>\n\t    [[Fish.Cop]]\n\n    -> Ask for signature (Truth).\n        [[Fish.Sign]]\n\n-> Ask for his signature.\n    [[Fish.Sign]]",
		"position": {
			"x": -1030,
			"y": -237
		},
		"colorID": 0
	},
	{
		"title": "Fish.Investigate",
		"tags": "",
		"body": "P: You know, this whole store has been kind of a question mark since I came in…\r\nA: I’m telling you, we’re legit. Just, just, just don’t mind the smartphone, how about these?\r\n<i>Alici brings attention to the furniture section of the store, specifically to the stained futon mattresses on display.</i>\r\nA: Real pristine bedsheets for all your sleeping needs.\r\nP: They have stains on them...\r\nA: It’s part of the looks… oh how do kids call it these days?\r\nA: The aesthetic; rustic and antique!\r\n<i>Pengi takes a look around and notices that when he looks to the backdoor behind the counter Alici’s face tenses.</i>\r\nP: What’s behind there?\r\nA: <size=125%>Nothing!</size> Nothing at all!\r\nP: Well you seem pretty nervous about it...if it's nothing, can i take a look? \r\n<i>Alici seems visibly taken aback.</i>\r\nA: Listen, I don’t want no trouble. I’m just running a simple family business here, all right? Real legitimate. Take whatever the hell you want. The futons, the oranges, my watch, my gun—\r\nP: You have a gun?!\r\nA: N-n-no! That was a joke, I’m a joker see! \r\n<i>He lifts his blazer and reveals a handgun tucked inside. He lets out a gurgle.</i>\r\n<<shake>>\r\nA: N-n-no! That ain’t supposed to be here. I’m legit, legit I swear!\r\n-> Rush towards the backdoor.\r\n    <i>Pengi rushes to the backdoor behind the counter. Alici chases after them but is too late. Behind the door are rows of desks sitting in the dark with poker chips laying on top of each one.</i>\r\n    P: Wha-what’s this!? \r\n    P: Are you running a gambling den?!\r\n    <i>Alici’s tries to say something, uttering gibberish noises before collapsing to his knees and cries.</i>\r\n    A: Yes! \r\n    <i>He holds his fish bowl in his hands spilling half the water out of it.</i>\r\n    A: Yes, I am<<wait 0.4>> .<<wait 0.4>> .<<wait 0.4>> .\r\n    A: There’s nothing I can do about it. \r\n    A: My family made me do it. They said-they said it was all for the family.\r\n    P: Are you an actual mafioso?! Like with all the illegal stuff?\r\n    A: I am!\r\n    <i>He begins to shake and gurgle, sloshing more water onto the floor</i>\r\n    <i>Pengi hands their handkerchief to Alici who wipes the water off the front of his bowl.</i>\r\n    <i>His shoulders slouched down in defeat.</i>\r\n    A: They wanted me to handle our little front, but…\r\n    A: I can’t handle it no more!\r\n    A: I’m not made for a life of crime! I couldn’t even sell you a freaking futon!\r\n    P: <i>Hmmm. This place is no good for this guy. Maybe him signing is actually a good thing?</i>\r\n    P: How about I get this trouble off your hands then? I represent a company interested in taking over the centre. They’ll even give you some money to start their businesses somewhere else.\r\n    A: W-wait...really?\r\n    A: But...the family will probably find out...\r\n    P: I don't think that's any worse than how your are living right now.\r\n    <i>Alici looks down at his two flippers then around at the tables in the darklit backroom.</i>\r\n    A: You know what...\r\n    A: Give me the damn paper, Imma sign it and use that money to do...something. \r\n    A: Anything but this.\r\n//fade to white\r\n    [[Fish.EndInvestigate]]\r\n\r\n-> Run away\r\n\t<i>Pengi take a step back in fright.</i>\r\n\t<<shake>>\r\n\tP: <size=150%>THAT’S A REAL GUN!</size>\r\n\tA: No! Don’t worry about it! Don’t tell anyone kid, ya hear?\r\n\tP: I-I swear I won’t! \r\n\tP: Just please don’t hurt me!\r\n\tA: I wont kid! Swears it, I’ve never even used this old thing!\r\n\tP: Ye-yeah.\r\n\t//<<playSFX SFXrunning>>\r\n\t<i>Pengi suddenly turns around and books it towards the front door.</i>\r\n\t[[Fish.EndPanic]]",
		"position": {
			"x": -1026,
			"y": -513
		},
		"colorID": 0
	},
	{
		"title": "Fish.Cop",
		"tags": "",
		"body": "P: Not a cop, but a private investigator. What are you going to do about it sir?\r\n<i>For a moment, Alici’s panic shows through the cracks of his calm demeanor.</i>\r\nA: That’s a real funny joke there friend. But I’ll have to ask you to stop cause it’s rude to impersonate an investigator.\r\nP: <i>Oh god, am I really going to impersonate an officer?</i>\r\n-> Commit to the bit.\r\n\t<i>Pengi straightens their back and looks Alici dead in the eye.</i>\r\n    P: I’m not joking. Look at all this weird stuff you’re selling. Smartphones with oranges, skateboards with dresses, antique swords with furniture. Who are you trying to fool? Yourself?\r\n    <i>A stream of bubbles leaves Alici’s mouth as he begins to stutter.</i>\r\n    A: W-What do you want me to say? W-We are the innovation of modern—\r\n    P: Cut it with that innovation malarkey. You and I both know this store is a front!\r\n    <i>Alici begins muttering more gibberish. As he does so, Pengi takes a look around the store. When they look towards the  backdoor behind the counter Alici shrieks.</i>\r\n    P: <i>Hmmm. Very interesting.</i>\r\n    [[Bring up the backdoor|Fish.EndGoodCop]]\r\n    [[Threaten with SWAT raid|Fish.EndBadCop]]\r\n\r\n-> Chicken out.\r\n    P: Oh man, what am I even doing?\r\n    <i>Pengi looks up at the fish who is now flowing in confusion.</i>\r\n    P: I-\r\n    P: I’m actually a member of Grounded Real Estates and we want to buy the rights to your store. \r\n    P: Sorry for all the trouble and stuff.\r\n    <i>There is a small pause before Alici responds, his voice curdling with anger.</i>\r\n    A: OH? So you WERE impersonating an officer of the law?\r\n    A: HAH! And now you wanna buy my shop?\r\n    <i>He lets out a roaring laugh while holding his belly.</i>\r\n    <i>Pengi winces at this sudden sound.</i>\r\n    A: I’ll be nice kid.\r\n    A: Leave.\r\n    <i>He squints his watery eye down at the shivering penguin</i>\r\n    A: Or thing’s will get ugly in here. .\r\n    [[Fish.EndPanic]]",
		"position": {
			"x": -710,
			"y": 173
		},
		"colorID": 0
	},
	{
		"title": "Fish.Sign",
		"tags": "",
		"body": "P: Actually, I’m a representative of Grounded Real Estates and I wanted to share with you our new proposition for the store owners at this Centre!\r\nA: Oh I see now, you the guy’s who’ve been poaching my store huh? \r\nA: Think you guys can come in here, all big men like, and just steal from the working class?\r\n<i>With his voice rising, Alici grabs one of the metal Louisville Sluggers from the sports and swiss cheese section.</i>\r\nP: <i>What is happening?! Is he going full mafioso on me?</i>\r\nA: I’m about to bust your head in like a watermelon if you don’t walk out this store kiddo. Scram!\r\n[[Fish.EndPanic]]",
		"position": {
			"x": -739,
			"y": -232
		},
		"colorID": 0
	},
	{
		"title": "Fish.EndInvestigate",
		"tags": "",
		"body": "<i>As Alici walks away from his life of crime, Pengi pulls out a lollipop from their pocket.</i>\r\nP: <i>Just another day in Menagerie Centre.</i> \r\nP: <i>Heh. This place never changes,</i>\r\nP: <i>always sucking the soles of everyone who lives here.</i>\r\nP: <i> The only person it didn’t was that poor dame I never managed to save—</i>\r\nA: Hey buddy, you gonna stay looking all melancholy all day?\r\nA: I need to close the store before leaving it for good.\r\nP: O-oh! Sorry, my bad!\r\n//variables: sign, no help\r\n[[Fish.End]]",
		"position": {
			"x": -1035,
			"y": -783
		},
		"colorID": 0
	},
	{
		"title": "Fish.EndPanic",
		"tags": "",
		"body": "<<changeBackground >>\r\n<i>Pengi rushes out of The Bargain Barrel. Hiding around the corner, they bend over while trying to catch their breath.</i>\r\n\r\nP: <i>What a disaster! Who knew actual gangsters operated here, and I didn’t even get a signature.</i>\r\nP: Damn!</i>\r\n//variables: no sign, no help\r\n[[Fish.End]]",
		"position": {
			"x": -389,
			"y": -232
		},
		"colorID": 0
	},
	{
		"title": "Fish.EndGoodCop",
		"tags": "",
		"body": "P: <i>This place is crazier than I thought! I didn’t get his signature, but maybe its for the best that this place gets forgotten...</i>\n//variables: no sign, help?\n[[Fish.End]]",
		"position": {
			"x": -377,
			"y": 169
		},
		"colorID": 0
	},
	{
		"title": "Fish.EndBadCop",
		"tags": "",
		"body": "P: <i>HAH, he’s scared. I can definitely get him with a little display of power.</i>\r\nP: Stop the act. I have a squad of SWAT waiting for my signal.\r\n<i>Alici grins, recomposing himself.</i>\r\nA: Show me your search warrant then, “investigator”.\r\nP: It’s… not with me right now…\r\nA: As I thought, get out of here you bozo!\r\nP: B-but they are all waiting for my signal you don-\r\nA: Oh yeah? Then do it. Show me pipsqueak. \r\nP: I-\r\n<i>Alici looks down, arms crossed, waiting for a response.</i>\r\nP: <i>Damn.</i>\r\nP:I-I’ll get out of your way. \r\nA: That’s what I thought. \r\nA: And don’t let the door hit you on the way out.\r\n<i></i>\r\nP:<i>Guess he got me. I think I came on too strong.</i>\r\n//variables: no sign, no friend\r\n[[Fish.End]]",
		"position": {
			"x": -377,
			"y": 463
		},
		"colorID": 0
	},
	{
		"title": "Fish.End",
		"tags": "",
		"body": "P: Well, at the end of the day I wasn’t able to find that old mole’s boot...\r\n<i>Pengi reaches into their suitcase and pulls out the manila folder containing the store owners names.</i>\r\n<i>Looking at the list, they sigh.</i>\r\nP: Annnnd that was the last of the owners I needed to talk to. \r\n<i>They furrowed their brow and scratched their beak nervously.</i>\r\nP: Not so sure if these are the results the boss was looking for, but we’ll find out soon enough. \r\n<i>Placing the paper back in their suitcase, they make their way back to the office.</i>\r\n\r\n[[End.Intro]]",
		"position": {
			"x": 141,
			"y": -241
		},
		"colorID": 0
	}
]