[
	{
		"title": "Intro.Mole",
		"tags": "",
		"body": "Pengi: Okokok OK!\nPengi: I got this!\nPengi: Phew. \n<i>There was so much at stack here, they had to do this job perfectly to get that raise.</i>\nPengi: I really hope I don't mess it up.\n<i>They nervously adjust their tie and pull out a handkerchief to wipe their beak.</i>\n<i>Hmmm<textSpeed=0.1/>...</textSpeed> now where exactly is this <b>‘Menagerie Centre’</b>? I need to get this done before my flight lessons later toda-</i>\n<<playSFX SFXbumpinto>>\n<<shake>>\n<<playAudio OldMole>>\nHeLLLlllOOOoo there, youNGSTER!\nPengi: Wha-what the?!\n-> Look around\n    <i>Pengi looks around, confused</i>\n    HellooOOOoooo HELLlooOoo over heeereee!\n    <i>They waddle around to look behind them. Still nothing.</i>\n    M: Down! LooOOkk DOwn!\n    <i>Surprised, Pengi looks down to see an Old Mole looking up at them through foggy glasses.</i>\n-> Look down\n    <i>They look down and see... nothing?</i>\n    Oh young one, bEHinNND you!\n    <i>Pengi turns around and still sees... nothing?</i>\n    M: Look down dear.\n    <i>Looking down once again, they are greeted with the face of wrinkled Old Mole</i>\nPengi: O-oh, hello there!?\n<i>She squints up at the well dressed bird through tiny glasses and beady, black eyes.</i>\nOld Mole: You wouldn’t have happened to see my <showItem shoe><b>Shoe</b>, no?\n<i>As impossible as it may seem, she squints even harder, her eyes seemingly disappearing into her graying fur.</i>\n<<hideItem shoe>>\nPengi: UUuuhhhh no? Look, I'm sorry bu-\n<<shake>>\n// screen shakes again while next description plays:\nPengi: Hey! Don't grab my shirt!\nOld Mole: OOOOoooooOoh please young one, could you help me find my <showItem shoe><b>Shoe</b>? \nOld Mole: It’s very important to me and my knees aren’t what they used to be. \nOld Mole: I was just sitting on a bench and suddenly-\n<i>She raises her hands, her puka-shell bag rustling at the sudden movement.</i>\n//what can indicate? flash of light??? not sure...\n<<fadePlainBackground on 0.2 block white>>\n<forceNext>\n<<hideItem shoe>>\n<<fadePlainBackground off 0.2 block white>>\nOld Mole: WHAM! ITS GONE!!! \n<i>Lowering her hands, her brow wrinkles.</i>\nOld Mole:  <size=75%>I swear <b>The Menagerie Centre</b> was where I was, no? Hmmmm... must have wandered off, just like my shoe... oh dear...\nPengi: Sorry, did you just say <b>The Menagerie Centre</b>?\nOld Mole: Yes dear! You know <b>The Menagerie Centre</b>, no? Just down the street, turn left, over the <showItem directionItem>yellow bridge, through the stream, past the hill, over the red bridge - not the yellow one - and through the corn field. Best and only <b>Centre</b> we have!\n<<hideItem directionItem>>\nPengi: ???<Surprise/Confused>\nOld Mole: SO, can you help me?\nPengi: <Confused>... \n<i>Pengi paused.</i>\n<i>They figured it wouldn't hurt to help a little right? Especially when they were headed there already.</i>\n<i>Pengi let out a sigh.</i>\nPengi: Fine. \nOld Mole: OH! Goodness, thank yoU!!! \nOld Mole: When you find it and bring it back, I’ll be sure to present you with a proper thank you gift.\n<i>She smiles sweetly, and with a curious glint in her eyes, promptly turns and walks away at a surprisingly brisk pace.</i>\n<<exitStage moleLady>>\nPengi: <Surprised> Oh wait! Where can I meet you once I... annnnnd she’s gone.\nPengi: <Normal> Alright. At least I know the way there now. \n<i>Using their impeccable memory, Pengi began following the Old Mole's convoluted directions.</i> \n<i>Panting, Pengi finally made it to <b>The Menagerie Centre</b>.</i>\n<<changeBackground generalMarket>>\n<<playAudio Market>>\n<i>What greets them first are the various sounds and smells of people chatting, food cooking and so on. </i>\n<i>Next came the sights, a street filled with various shops, all seemingly different and random compared to the next.</i>\n<i>Overwhelmed by the smells and sounds surrounding the area, Pengi rushes to pull out the folder and look for the stores they need to go to.</i>\n<i>They quickly rush into the first store on their list.</i>\n//fade to white and move to Brynhilda\n<<set $HHelp = false>>\n<<set $HSign = false>>\n<<set $BHelp = false>>\n<<set $BSign = false>>\n<<set $AHelp = false>>\n<<set $ASign = false>>\n<<set $signature = 0>>\n<<fadePlainBackground on 0.5 block white>>\n<forceNext>\n<<playAudio hippobgm>>\n<<wait 0.2>>\n<<changeBackground hipposCampus>>\n<<fadePlainBackground off 0.5 block white>>\n<forceNext>\n[[Hippo.Intro]]\n",
		"position": {
			"x": -559,
			"y": -9
		},
		"colorID": 0
	},
	{
		"title": "Intro.Dream",
		"tags": "",
		"body": "<<changeBackground cockpit>>\n<<playAudio pilotDream>>\n<<playSFX radio>>\n//clouds are moving, soft light??, maybe pengi moving back and forth?\n//SFX: radio sound? GOLD\nP, pilot: Hello everyone, this is your captain speaking.\nP, pilot: Hope you've enjoyed this wonderful flight so far.\nP, pilot: As you look over to the left side of the plane you'll see the sun rising over the ocean.\n<<changeBackground sunset>>\n//Background cuts to shot of sunrise over ocean\n<i>The morning sun's rays glisten through the clouds.</i>\nP, pilot: Ain’t it something?\n<<shake>>\n<<playSFX SFXsoftwhack>>\nP, pilot: Huh?\n<<playSFX SFXsoftwhack>>\n<<shake>>\n<<enterStage Paul>>\n->Look for who did that\n    <i>Pengi turns their head, looking for the source of the voice</i>\n    PtC, notVisible: The boss is going to find you slacking again, so stop dozing off.\n    <<playSFX SFXsoftwhack>>\n    <<shake>>\n->Question the voice\n\tP, pilot: Who said that?\n    PtC, notVisible: Hehehe, it’s me, your conscience and I’m here to tell you to wake up.\n    <<playSFX SFXsoftwhack>>\n    <<shake>>\nP, pilot: Stop. Stop. Stop!\n\n<<playSFX SFXwhack>>\n<<playAudio officeBg>>\n<<fadePlainBackground on 2 block white>>\n<<changeBackground office>>\nPengi: <forceNext>\nThis is a hack <forceNext>\n<<wait 2>>\n<<fadePlainBackground off 1 block white>>\n[[Intro.Office]]",
		"position": {
			"x": -1293,
			"y": -20
		},
		"colorID": 0
	},
	{
		"title": "Intro.Office",
		"tags": "",
		"body": "<<enterStage Paul>>\n\n<i>Wiping off the drool running down their face, Pengi opens their eyes and realizes they are back in their dour office, surrounded by the same coworkers, sitting in the desk they had been assigned a year ago.</i>\n<i>They sigh.</i>\n\nPtC: You were dreaming about flying again, weren’t you?\n\nP:\n-> N-no I wasn’t...\n    PtC: Sure, and I’m the king of the Antarctic. You need to learn to lie better.\n    // Since there is a color out there, we have to be explicit about who is speaking\n    <i>Pengi focuses back on their computer desk, littered with <showItem paperStack>spreadsheets they didn’t understand the purpose of filling out.</i> \n    <i>It was the same work each week.</i>\n    <i>Get this name, attach this file, calculate this total, remove these liabilities. </i>\n    <i>It never changed.</i>\n\n\n-> MaybeeE…?\n    PtC: Well, focus up. The last time the boss caught you dozing off I got in trouble as well.\n    <i>After shaking their head in disbelief, Pengi scans the cubicles surrounding them.\n    <i>Each was occupied by a person that barely greeted them in the morning, and to be frank, these were people they didn’t much care to know.</i>\n\nPtC: By the way, the boss lady is looking for you.\n\n<i>His beak curves into a coy grin.</i>\n\nPtC: Think she’s got an important assignment for you.\n\n<i>He winks.</i>\n<<exitStage Paul>>\n<i>Pengi rolls their eyes before leaving their desk.</i>\n<<hideItem paperStack>>\n<<fadePlainBackground on 0.5 block white>>\n<forceNext>\n<<wait 0.2>>\n<<changeBackground Boss>>\n<<fadePlainBackground off 0.5 block white>>\n<forceNext>\n<<enterStage Patricia>>\n\n[[Intro.Boss]]",
		"position": {
			"x": -1045,
			"y": -9
		},
		"colorID": 0
	},
	{
		"title": "Intro.Boss",
		"tags": "",
		"body": "<i>They walk up to the boss lady’s office, which is fenced in from both sides by cubicles of people Pengi has never seen outside the office.<i/>\n<i>When they finally arrive in front of the glass door of the boss’ office, they take a long breath and turn the handle.</i>\nPB: Ah, Pengsworth, just the bird I wanted to see!\n\n-> M-m-my name is P-Pengi...\n    PB: Oh?\n    <i>Her head cocks as her eyes squint at Pengi. They step back; retorting has never been much of a good idea.</i>\n    <i>Patricia’s nose wrinkles and she clicks her tongue.</i>\n    PB: Well that’s unfortunate. Pengsworth suits you better, but I won’t judge.\n\n-> Say nothing\n    PB: Are you related to <showItem weirdBird>Pengsworth the Noble? Oh, I remember having such a massive crush on him when I was a teenager. \n    PB: If you ever read the Noble Books you would know why...\n    P: <i>I wonder how long she’ll go on for this time. One of these days I really should bring a timer to one of her tangents… I really need to get out of here one day</i>\n    <<hideItem weirdBird>>\n\nPB: Enough dillydallying Pengsworth, time to talk real business. Stop derailing our conversations.\n<i>Pengi turns their head, as if looking for an imaginary audience that could confirm what was happening.</i>\nPB: Are you still interested in flight school?\nP: Y-y-yes… Yes!\nPB: PB: Well, well, quite the dreamer, aren’t you? Might be hard to get in... costs a lot of money...\n\n\n<i>She trails off before letting out a soft snicker which quickly turns into a giggle.</i>\nPB: Oh, yes, what a wonderful dream... for a PENGUIN!\n<i>She snorts and squeals into a burst of laughter, nearly knocking her coffee mug off her desk.</i>\n<i>Blushing, Pengi turns around, ready to exit the office, when Patricia calls out to them.</i>\nPB: <size=115%>Pengsworth!</size> Pengsworth, wait!\n<i>She clears her throat in an attempt to compose herself.</i>\nPB: We here at Grounded Real Estates are nothing if not supportive of our employees.\n<i>Her lips are twist into a tense smile trying to hold back another outburst.</i>\nPB: As such, we would love to present this wonderful opportunity to you, one of said wonderful employees!\n<i>She snorts again as she slides a file folder towards Pengi. </i>\nPB: It’s an old <showItem stripMall>strip mall we haven’t managed to get a hold of. \nPB: The store owners there are tenacious and refuse to let go of the property, but if you’re able to get them to sign...\nPB: <b> I’ll consider giving you a sizable raise.</b>\n<i>Her cheeks twitch.</i>\nPB: Maybe then your <i>Dream</i> might come true, <size=120%>Flyboy!</size>\n<i>And she knocks herself off her chair, rolling on the floor laughing.</i>\n<<hideItem stripMall>>\n<<exitStage Patricia>>\n<i>Taking the brown manila folder, Pengi sneaks out of the office as the snorts and oinks follow behind them.</i>\n<i>They make their way through the maze of cubicles and back to their desk. Paul looks over and grins upon seeing Pengi’s flushed face.</i>\n<<enterStage Paul>>\nPtC: So, I’m guessing it’s nothing good, huh?\n<i>Pengi hands the folder to Paul and sits back down to sip their coffee and try to erase the memory of what just happened.</i>\n<i>Paul lets out a long whistle.</i>\nPtC: Menagerie Centre... That's a tough one.\nP: You’ve heard of it then?\nPtC: Ms. Piggie sent me to do it a few months ago. Grounded wants to buy it up as part of their modernization initiative.\nP: Oh, it's a popular spot? Weird. I’ve never heard of it.\nPtC: Apparently it's in decline, but will be popular once we modernize it. \nPtC: At least, that's what the Analytics Department says.\nP: How are they so sure about that?\n<i>Paul shrugs.</i>\nPtC: I don’t know. Never really read their reports, and let's be honest, no one really does. \nPtC: I just do it for the paycheck. \nPtC: Anyways, when I was sent it wasn’t a pretty affair. Surprised the boss lady managed to rope you into doing it.\n<i>Pengi blushes.</i>\nP: She said she’d give me a big enough raise to go to <showItem plane>flight school. \nP: ...\nP: ...She was lying, wasn’t she? <size=80%>Dammit Pengi! You can be so gullible sometimes!</size>\n<<hideItem plane>>\nPtC: I don’t think so… Piggie is a savage, but she’s a woman of her word. \nPtC: I think you got a real shot at getting into flight school if you manage to get this done.\n<<exitStage Paul>>\nP: ...\n<i>Pengi pauses and looks at their surroundings.</i>\n<i> They see the dreary walls of the office and remembers the sunrise in their dreams.</i>\n<i> Filled with determination, they snatch the envelope back from Paul and rush out the office with only a single purpose in mind.</i>\n<i> That raise was theirs.</i>\n//Fade out and add pause as we transition to a new area\n<<fadePlainBackground on 0.5 block white>>\n<forceNext>\n<<playAudio Market>>\n<<wait 0.2>>\n<<changeBackground street>>\n<<fadePlainBackground off 0.5 block white>>\n<forceNext>\n<<enterStage oldMole>>\n[[Intro.Mole]]",
		"position": {
			"x": -795,
			"y": -10
		},
		"colorID": 0
	}
]